Конфигурация отчетов/DataProcessors/ТестированиеАнализа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТестированиеАнализа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЗаписей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кол_Нач_товар</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кол_Кон_Товар</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кол_Нач_товар2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кол_Кон_Товар2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПереучета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Списание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеПересорта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подчиненный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/ИнформацияДляАнализа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИнформацияДляАнализа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТоварПодчиненный2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТоварРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииАнализа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварПодчиненный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/Enums/ВидыОперацииАнализа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацииАнализа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/ТестированиеАнализа/Forms/Форма/Ext/Form/Module.bsl
//&НаСервере
//Процедура СоздатьТестовыйТоварНаСервере()

//	А = 0;
//	Пока А < 1000 Цикл
//		Товар = Справочники.ТестовыеТовары.СоздатьЭлемент();
//		Товар.Наименование = "Товар_"+Строка(А);
//		Товар.Записать();
//		Сообщить("Создан товар " + Товар.Наименование);	
//		А = А + 1;
//	КонецЦикла;

//КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьТестовыйТовар(Команда)
//	СоздатьТестовыйТоварНаСервере();
//КонецПроцедуры


//Процедура ЗаполнитьТестовыеСвязи() Экспорт
//	Генератор = Новый ГенераторСлучайныхЧисел;

//	// Получаем все товары из справочника
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ТестовыеТовары.Ссылка КАК Товар
//		|ИЗ
//		|	Справочник.ТестовыеТовары КАК ТестовыеТовары
//		|ГДЕ
//		|	НЕ ТестовыеТовары.ПометкаУдаления";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Товары = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Товар");
//	
//	// Очищаем регистр перед заполнением
//	НаборЗаписей = РегистрыСведений.ИнформацияДляАнализа.СоздатьНаборЗаписей();
//	НаборЗаписей.Записать();
//	
//	// Создаем массив для отслеживания существующих связей
//	СуществующиеСвязи = Новый Соответствие;
//	
//	// Максимальное количество связей для одного товара
//	МаксимумСвязей = 10;
//	
//	Для Каждого ТоварРодитель Из Товары Цикл
//		// Получаем случайное количество связей (от 1 до МаксимумСвязей)
//		КоличествоСвязей = СлучайноеЧисло(1, МаксимумСвязей);
//		
//		// Создаем список доступных товаров для связи (исключая сам товар)
//		ДоступныеТовары = Новый Массив;
//		Для Каждого Товар Из Товары Цикл
//			Если Товар <> ТоварРодитель Тогда
//				ДоступныеТовары.Добавить(Товар);
//			КонецЕсли;
//		КонецЦикла;
//		
//		// Перемешиваем массив для случайного выбора
//		ПеремешатьМассив(ДоступныеТовары);
//		
//		// Создаем связи
//		Для Сч = 1 По Мин(КоличествоСвязей, ДоступныеТовары.Количество()) Цикл
//			ТоварПодчиненный = ДоступныеТовары[Сч - 1];
//			
//			// Проверяем, нет ли обратной связи
//			Если СуществующиеСвязи.Получить(ТоварПодчиненный) = Неопределено 
//			 Или СуществующиеСвязи[ТоварПодчиненный].Найти(ТоварРодитель) = Неопределено Тогда
//				
//				// Добавляем запись в регистр
//				НаборЗаписей = РегистрыСведений.ИнформацияДляАнализа.СоздатьНаборЗаписей();
//				НаборЗаписей.Отбор.ТоварРодитель.Установить(ТоварРодитель);
//				НаборЗаписей.Отбор.ТоварПодчиненный.Установить(ТоварПодчиненный);
//				
//				НоваяЗапись = НаборЗаписей.Добавить();
//				НоваяЗапись.ТоварРодитель = ТоварРодитель;
//				НоваяЗапись.ТоварПодчиненный = ТоварПодчиненный;
//				
//				НаборЗаписей.Записать(Истина);
//				
//				// Сохраняем связь для проверки обратных связей
//				Если СуществующиеСвязи.Получить(ТоварРодитель) = Неопределено Тогда
//					СуществующиеСвязи.Вставить(ТоварРодитель, Новый Массив);
//				КонецЕсли;
//				СуществующиеСвязи[ТоварРодитель].Добавить(ТоварПодчиненный);
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	
//	Сообщить("Заполнение тестовых связей завершено!");
//КонецПроцедуры

////// Вспомогательная функция для генерации случайного числа
////Функция СлучайноеЧисло(Мин, Макс)
////	Генератор = Новый ГенераторСлучайныхЧисел;
////	Возврат Генератор.СлучайноеЧисло(Мин, Макс);
////КонецФункции

//// Вспомогательная функция для перемешивания массива
//Процедура ПеремешатьМассив(Массив)
//	Генератор = Новый ГенераторСлучайныхЧисел;
//	Для Индекс = Массив.Количество() - 1 По 1 Цикл
//		ИндексСлучайный = Генератор.СлучайноеЧисло(0, Индекс);
//		ВременноеЗначение = Массив[Индекс];
//		Массив[Индекс] = Массив[ИндексСлучайный];
//		Массив[ИндексСлучайный] = ВременноеЗначение;
//	КонецЦикла;
//КонецПроцедуры


//&НаКлиенте
//Процедура ЗаполнитьСвязиТоваров(Команда)
//	ЗаполнитьТестовыеСвязи();
//КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере() 
	Генератор = Новый ГенераторСлучайныхЧисел;
	ТабличнаяЧасть = Объект.ДанныеПереучета;
	ТабличнаяЧасть.Очистить();
	Количество = Строка(Объект.КоличествоЗаписей);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	ТМЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТМЦ КАК ТМЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Отрицательно = 0;
	Пока Выборка.Следующий() Цикл
		Число = Генератор.СлучайноеЧисло(1, 200);

		Нов = ТабличнаяЧасть.Добавить();
		Нов.Товар = Выборка.Ссылка;
		Если Отрицательно = 3 Тогда
			Нов.Количество = -(Число);
		Иначе
			Нов.Количество = Число;
		КонецЕсли;
		Если Отрицательно = 3 Тогда
			Отрицательно = 0;
		КонецЕсли;
		Отрицательно = Отрицательно + 1;
	КонецЦикла;
	


	
	Сообщить("Табличная часть заполнена случайными данными!");
КонецПроцедуры

&НаКлиенте
Процедура Анализ(Команда)
	АнализНаСервере();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПозицииПересорта()
	ПозицииПересорта = Новый Соответствие;
	Для Каждого Тов Из Объект.ДанныеПереучета Цикл

		ПозицииПересорта.Вставить(Тов.Товар, Тов.Количество);

	КонецЦикла;
	
	Возврат ПозицииПересорта;
КонецФункции // ЗаполнитьПозииПересорта()

&НаСервере
Функция ПолучитьМассивСПересортом(Товар)
	
	МассивПерсорта = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформацияДляАнализа.ТоварРодитель КАК ТоварРодитель,
		|	ИнформацияДляАнализа.ВидИнформации КАК ВидИнформации,
		|	ИнформацияДляАнализа.ТоварПодчиненный КАК ТоварПодчиненный
		|ИЗ
		|	РегистрСведений.ИнформацияДляАнализа КАК ИнформацияДляАнализа
		|ГДЕ
		|	ИнформацияДляАнализа.ТоварРодитель = &ТоварРодитель
		|	И ИнформацияДляАнализа.ВидИнформации = &ВидИнформации";
	
	//Запрос.УстановитьПараметр("ВидИнформации", Перечисления.ВидыОперацииАнализа.Пересорт);
	Запрос.УстановитьПараметр("ТоварРодитель", Товар);
	Запрос.УстановитьПараметр("ВидИнформации", Перечисления.ВидыОперацииАнализа.Пересорт);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивПерсорта.Добавить(Выборка.ТоварПодчиненный);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформацияДляАнализа.ТоварРодитель КАК ТоварРодитель,
		|	ИнформацияДляАнализа.ВидИнформации КАК ВидИнформации,
		|	ИнформацияДляАнализа.ТоварПодчиненный КАК ТоварПодчиненный
		|ИЗ
		|	РегистрСведений.ИнформацияДляАнализа КАК ИнформацияДляАнализа
		|ГДЕ
		|	ИнформацияДляАнализа.ТоварПодчиненный = &ТоварПодчиненный
		|	И ИнформацияДляАнализа.ВидИнформации = &ВидИнформации";
	
	//Запрос.УстановитьПараметр("ВидИнформации", Перечисления.ВидыОперацииАнализа.Пересорт);
	Запрос.УстановитьПараметр("ТоварПодчиненный", Товар);
	Запрос.УстановитьПараметр("ВидИнформации", Перечисления.ВидыОперацииАнализа.Пересорт);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивПерсорта.Добавить(Выборка.ТоварРодитель);
	КонецЦикла;

	Возврат МассивПерсорта; 	

КонецФункции // ПолучитьМассивСПересортом()


&НаСервере
Функция ПолучитьСписокПозицийПересортов(ПозицииПересорта)
	ТоварПересорта = Новый Соответствие;
	Для Каждого Товар Из ПозицииПересорта Цикл
		МассивСПересортом = ПолучитьМассивСПересортом(Товар.Ключ);	
		ТоварПересорта.Вставить(Товар.Ключ, МассивСПересортом); 
	КонецЦикла;
	
	Возврат ТоварПересорта;
КонецФункции // ПолучитьСписокПозицийПересортов()

&НаСервере
Функция СоздатьМассивСписаний()

	МассивСписаний = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформацияДляАнализа.ТоварРодитель КАК ТоварРодитель,
		|	ИнформацияДляАнализа.ВидИнформации КАК ВидИнформации
		|ИЗ
		|	РегистрСведений.ИнформацияДляАнализа КАК ИнформацияДляАнализа
		|ГДЕ
		|	ИнформацияДляАнализа.ВидИнформации = &ВидИнформации";
	
	Запрос.УстановитьПараметр("ВидИнформации", Перечисления.ВидыОперацииАнализа.Списание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивСписаний.Добавить(Выборка.ТоварРодитель);
	КонецЦикла;
	
	Возврат МассивСписаний;


КонецФункции // СоздатьМассивСписаний()


&НаСервере
Процедура АнализНаСервере()
	МассивСписаний = СоздатьМассивСписаний();
	
	
	
	Объект.Пересорт.Очистить();
	//собираем позиции для пересорта
	КоличествоТоваров = ЗаполнитьПозицииПересорта(); 
	СписокПересортов = ПолучитьСписокПозицийПересортов(КоличествоТоваров);
	
	Для Каждого Товар Из Объект.ДанныеПереучета Цикл
		Если МассивСписаний.Найти(Товар.Товар) <> Неопределено Тогда
			Запись = Объект.Списание.Добавить();
			Запись.Товар = Товар.Товар;
			Запись.Количество = Товар.Количество;
			Товар.Количество = 0;
		КонецЕсли;
		Если Товар.Количество > 0 Тогда
			//анализ
			Недостача = -(Товар.Количество);
			//получаем все позиции пересорат
			МассивПересортов = СписокПересортов.Получить(Товар.Товар);
			//обрабатываем каждый елемент массива
			Для Каждого А Из МассивПересортов Цикл
				//получаем количество
				Если КоличествоТоваров.Получить(А) = Неопределено Тогда
					Продолжить;
				КонецЕсли;	
				ДоступноКоличество = -(КоличествоТоваров.Получить(А));     //-100+50 меньше 0 - нехватило 
				Если ДоступноКоличество > 0 Тогда
					//проверяем сколько можно сделать пересорта
					Остаток = Недостача + ДоступноКоличество;  
					Если Остаток < 0 Тогда
						//списываем вест товар
						Запись = Объект.Пересорт.Добавить();
						Запись.Товар = Товар.Товар;
						Запись.Кол_Нач_товар = Недостача;
						Запись.Кол_Кон_Товар = Недостача + ДоступноКоличество;
						Запись.Операция = ДоступноКоличество;
						Запись.Товар2 = А;
						Запись.Кол_Нач_товар2 = ДоступноКоличество;
						Запись.Кол_Кон_Товар2 = 0;
						КоличествоТоваров.Вставить(А, 0);
					ИначеЕсли Остаток > 0 Тогда
 
						Запись = Объект.Пересорт.Добавить();
						Запись.Товар = Товар.Товар;
						Запись.Кол_Нач_товар = Недостача;
						Запись.Кол_Кон_Товар = 0;
						Запись.Операция = Недостача;
						Запись.Товар2 = А;
						Запись.Кол_Нач_товар2 = ДоступноКоличество;
						
						ОстатокТовараПосле = Недостача + ДоступноКоличество; 
						Запись.Кол_Кон_Товар2 = ОстатокТовараПосле;

						КоличествоТоваров.Вставить(А, ОстатокТовараПосле);
	                ИначеЕсли Остаток = 0 Тогда
				    							//списываем вест товар
						Запись = Объект.Пересорт.Добавить();
						Запись.Товар = Товар.Товар;
						Запись.Кол_Нач_товар = Недостача;
						Запись.Кол_Кон_Товар = 0;
						Запись.Операция = Недостача;
						Запись.Товар2 = А;
						Запись.Кол_Нач_товар2 = ДоступноКоличество;
						Запись.Кол_Кон_Товар2 = 0;
						КоличествоТоваров.Вставить(А, 0);

					КонецЕсли;
					Запись.Кол_Нач_товар = -(Запись.Кол_Нач_товар);
					Запись.Кол_Кон_Товар = -(Запись.Кол_Кон_Товар);
					//Товар.Количество = Запись.Кол_Кон_Товар;	
					
					Недостача = -(Запись.Кол_Кон_Товар);
					Если Запись.Кол_Кон_Товар = 0 Тогда
					
						Прервать;	
					
					КонецЕсли;
					//записываем остаток недостачи и пересорта
				КонецЕсли;
						
			КонецЦикла;//редактируем количество
	
		КонецЕсли;
	КонецЦикла;
	//Доступные количества по каждой позицмм
	//редактируем по надобности
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТМЦ_Регистр(Родитель, Подчиненный)

	Запись = РегистрыСведений.ИнформацияДляАнализа.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
	Запись.ТоварРодитель = Родитель;
	Запись.ТоварПодчиненный2 = Подчиненный;

    Попытка
        Запись.Записать(Истина);
		Сообщить("Вид задачи успешно обновлен ");

    Исключение
        Сообщить("Ошибка при записи в регистр сведений: " + ОписаниеОшибки());
    КонецПопытки;
	

КонецПроцедуры // ЗаполнитьТМЦ_Регистр()


&НаСервере
Процедура ПроверкаСвязи(ТоварРодитель, ТоварПодчиненный)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформацияДляАнализа.ТоварРодитель КАК ТоварРодитель,
		|	ИнформацияДляАнализа.ТоварПодчиненный КАК ТоварПодчиненный
		|ИЗ
		|	РегистрСведений.ИнформацияДляАнализа КАК ИнформацияДляАнализа
		|ГДЕ
		|	ИнформацияДляАнализа.ТоварРодитель = &ТоварРодитель
		|	И ИнформацияДляАнализа.ТоварПодчиненный = &ТоварПодчиненный";
	
	Запрос.УстановитьПараметр("ТоварПодчиненный", ТоварПодчиненный);
	Запрос.УстановитьПараметр("ТоварРодитель", ТоварРодитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//запись есть
		Возврат;
	КонецЦикла;

	ЗаполнитьТМЦ_Регистр(ТоварРодитель, ТоварПодчиненный);

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРегистрНаСервере()
	
	Для Каждого ТМЦ Из Объект.ЗаполнениеПересорта Цикл
		ПроверкаСвязи(ТМЦ.Родитель, ТМЦ.Подчиненный);	
		//ПроверкаВсехСвязей(ТМЦ.Родитель, ТМЦ.Подчиненный);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРегистр(Команда)
	ЗаполнитьРегистрНаСервере();
КонецПроцедуры

//// Вспомогательная функция для генерации случайного числа
//Функция СлучайноеЧисло(Мин, Макс)
//	
//	Число = Генератор.СлучайноеЧисло(Мин, Макс);
//	Возврат Число;
//КонецФункции
